using HomeWork_06_1;

//Доробку відклав
//Багато часу витратив на проектування структури і двіжку работи з БД
//на цей час БД наповнюеться
//повторні данні не додаются, а оновлюють наявні. 
//екземпляри класів можуть буди просто створені, а можуть буди збереженмим у БД.
//намагавля зробити рибу для переносу БД у майбутньому із текстового файлу на реальну СУБД

RowDataApartment ap = new("12");                            //словник квартир
RowDataOwner owner = new("Сидоров");                        //словник власників квартир
RowDataApartmentRent apRent = new("2022.03.01 43 Петров");  //регістр хто у якому місяці володіє квартирою
RowDataMeterValue meter = new("2022.03.01 43 54");          //регістр показників лічільників по квартирі за відповідний місяць

RowData.ShowStorage();


