//У текстовому файлі задано текст, між словами якого може бути довільна кількість пропусків.
//Знаки пунктуації використані правильно і є прив’язані до слів.

//Створити клас для роботи з текстом, який вміє читати інформацію з потоку та видрукувати інформацію,
//а також матиме методи для редагування та обробки інформації

//Поділити текст на речення та видрукувати кожне речення з абзацу у вихідний файл “Result.txt”,
//який обов’язково додати до репозиторію. Вважати, що речення можуть бути в кількох стрічках.
//На екран видрукувати найдовші та найкоротші слова у кожному реченні.


using HomeWork_06_2;

//Створити клас для роботи з текстом, 
StringReaderCamp str = new StringReaderCamp("..\\..\\..\\Input.txt");
str.ExtAction = Console.WriteLine;

//який вміє читати інформацію з потоку та видрукувати інформацію,
str.ExtAction("-----Content------"); 
str.ShowContent();

//Поділити текст на речення та видрукувати кожне речення з абзацу у вихідний файл “Result.txt”,
//який обов’язково додати до репозиторію. Вважати, що речення можуть бути в кількох стрічках.
List<string> sentences = str.SplitеTextIntoSentences();
str.SaveToFile("..\\..\\..\\Result.txt", sentences);

//На екран видрукувати найдовші та найкоротші слова у кожному реченні.
str.ExtAction(""); 
str.ExtAction("-----ShortLong------");
str.ShowShortLongWords(sentences);



